const SPEC_MAPPINGS = [
    {
        sourceKey: 'CPU count',
        shortLabel: 'TRM',
    },
    {
        sourceKey: 'Memory',
        shortLabel: 'RAM',
    },
    {
        sourceKey: 'Disk space',
        shortLabel: 'NVMe',
    },
    {
        sourceKey: 'Port speed',
        shortLabel: 'Mbps',
    }
];

const OPORTUNITIES = [
    ["Бесперебойный доступ к рынку 24/7", "Стабильная ручная торговля", "Базовая автоматизация и скрипты"],
    ["Диверсификация торговых стратегий", "Работа простых роботов и советников", "Мониторинг со стандартными индикаторами"],
    ["Мгновенный отклик и исполнение", "Комфортный бэктестинг и оптимизация", "Работа с продвинутыми индикаторами"],
    ["Профессиональное управление капиталом", "Запуск сложных систем и алгоритмов", "Обработка больших архивов данных"]
];

const RELEVANT = [
    ["Личное использование", "Микро-счета", "Свинг-трейдинг", "Начальный уровень", "Старт автоматизации"],
    ["Среднесрочные стратегии", "Интрадей-трейдинг", "Мультиаккаунтинг", "Автоторговля", "Контроль рисков"],
    ["Оптимизация роботов", "Тех анализ", "Тестирование стратегий", "Алгоритмическая торговля"],
    ["Интенсивный трейдинг", "Копирование сделок", "Увеличенная нагрузка"]
]

export {
    SPEC_MAPPINGS,
    OPORTUNITIES,
    RELEVANT
}